#include <iostream>
using namespace std;

/*Завдання 2:
Спочатку вводимо 3 значення a, b, c.

(В "якщо" у нас не порівняння (==), присвоєння (=), 
тому в "якщо" у нас с яке ми вводимо як 50 спочатку отримує значення різниці a і b) 

Тобто результатом виконання програми буде виведення значень a, b які ми вписали і с який буде мати значення різниці a і b.
*/

//Завдання 3:
int main()
{
    int a, b, c;

    cout << "Please enter three numbers) \n";
    cout << "a: ";
    cin >> a;
    cout << "\nb: ";
    cin >> b;
    cout << "\nc: ";
    cin >> c;

    if (c = (a - b)) // тут має буди оператор порівняння "==", тобто c == (a - b)
    {
        cout << "\na: ";
        cout << a;
        cout << " minus b: ";
        cout << b;
        cout << " equals c: ";
        cout << c << endl;
    }
    else
        cout << "a - b does not equal c: "<< endl; //тут можна додати << c, після стрінгу

    return 0;
}

/*
Так. 
Але підозрюю що ціллю програми було порівняння значення с та різниці a і b.
Тому в "якщо" має бути вираз c == (a - b).
І в "або"  cout << "a - b does not equal c: " << c << endl;
*/