#include <iostream>
using namespace std;

/*
2. Напишіть програму, яка оголошує константний вказівник на постійне ціле значення. 
Ініціалізуйте цей вказівник, щоб він вказав на цілісну змінну varOne. 
Надайте змінній varOne значення 6. 
Використовуйте вказівник, щоб, присвоїти змінній varOne значення 7. 
Створіть другу цілочисленну змінну varTwo. 
Перепризначте вказівник, щоб він вказував на змінну varTwo. 
Поки не компілюйте цю вправу.
*/

///*
int main()
{
    const int* const constPtr;
    int varOne;

    constPtr = &varOne;

    varOne = 6;

    (*constPtr) = 7;

    int varTwo;

    constPtr = &varTwo;

}
//*/

/*
3. Скомпілюйте програму, написану у вправі 2. Які дії компілятор вважає помилковими? Які рядки генерують попередження?
*/